In [ ]:
# import libraries untuk data cleaning, manipulation and exploratory data analysis
import pandas as pd

# fungsi untuk menampilkan semua kolom DataFrame saat membaca datasetnya di output
pd.set_option('display.max_columns', None)

# fungsi untuk ignore warnings
import warnings
warnings.filterwarnings("ignore")

# **WALMART RETAIL SALES PERFOMANCE ANALYSIS (PYTHON & SQL)**

Dataset: [Dataset Source](https://www.kaggle.com/datasets/najir0123/walmart-10k-sales-datasets)
## **by : Grace Natalie Catherine**

**BACKGROUND, DATA CLEANING & INITIAL EDA WITH PYTHON**

---

## **1. Business Problem Understanding**

## **Problem Statement**

#### **Main Business Problem**
Walmart faces challenges in **understanding performance variations across cities, categories, and time periods**.

#### **Main Business Question**

How can Walmart **optimize sales performance, profitability, and operational efficiency** across branches by leveraging transactional data to better **understand customer behavior, demand patterns, payment preferences, and product category performance**?

-------

The problem breakdowns:

#### **A. Customer Payment Behavior/Preference**
- What payment methods are used by customers, how many transactions and items are sold through each method?
- What is the most frequently used payment method in each branch?

#### **B. Product Category Performance Based on Profitability & Customer Satisfaction**
- Which product category has the highest average rating in each branch?
- What is the total profit of each categories? Which product categories generate the highest revenue and total profit?

#### **C. Operational Demand & Time-Based Sales Patterns**
- What is the busiest day of the week and time of the day for each branch based on transaction volume?

#### **D. Sales Performance Across Branch and Cities**
- Which cities and branches contribute the most to total revenue?

# **Goals**

- Customer payment behavior analysis to support localized promotion and payment strategy.
- Product category performance evaluation to optimize inventory and marketing decisions.
- Time-based operational demand analysis to improve staffing and operational efficiency.
- Branch and city sales performance analysis to guide strategy and resource allocation across branches and cities.
- Business-driven strategic recommendations for improving profitability and operational effectiveness.

In [27]:
# read dataset

df = pd.read_csv('Walmart.csv')

df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

## **2. Data Understanding**

This dataset contains 10,051 retail sales transactions with 11 variables capturing transaction details, store location, product information, payment behavior, and performance metrics.

| No | Column Name      | Description                                      |
| -- | ---------------- | ------------------------------------------------ |
| 1  | `invoice_id`     | Unique identifier for each sales transaction     |
| 2  | `Branch`         | Branch code where the transaction occurred       |
| 3  | `City`           | City in which the branch is located              |
| 4  | `category`       | Product category purchased by the customer       |
| 5  | `unit_price`     | Price per unit of the product                    |
| 6  | `quantity`       | Number of units purchased in the transaction     |
| 7  | `date`           | Transaction date                                 |
| 8  | `time`           | Transaction time                                 |
| 9  | `payment_method` | Payment method used by the customer              |
| 10 | `rating`         | Customer satisfaction rating for the transaction |
| 11 | `profit_margin`  | Profit margin generated from the transaction     |

In [28]:
# check missing values

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [29]:
# check duplicates

df.duplicated().sum()

np.int64(51)

In [30]:
import pandas as pd

profile_data = []

for col in df.columns:
    null_count = df[col].isna().sum()
    profile_data.append([
        col,                                 # column name
        df[col].dtype,                      # data type
        null_count,                         # number of null values
        round((null_count / len(df)) * 100, 2),  # percentage of null values
        df[col].nunique(),                  # number of unique values
        df[col].drop_duplicates().tolist()  # list of unique values
    ])

df_profile = pd.DataFrame(
    profile_data,
    columns=[
        "column_name",
        "data_type",
        "null_count",
        "null_percentage",
        "unique_count",
        "unique_values"
    ]
)

df_profile

,column_name,data_type,null_count,null_percentage,unique_count,unique_values
0,invoice_id,int64,0,0.00,10000,"[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14..."
1,Branch,object,0,0.00,100,"[WALM003, WALM048, WALM067, WALM064, WALM013, ..."
2,City,object,0,0.00,98,"[San Antonio, Harlingen, Haltom City, Bedford,..."
3,category,object,0,0.00,6,"[Health and beauty, Electronic accessories, Ho..."
4,unit_price,object,31,0.31,1008,"[$74.69, $15.28, $46.33, $58.22, $86.31, $85.3..."
5,quantity,float64,31,0.31,10,"[7.0, 5.0, 8.0, 6.0, 10.0, 2.0, 3.0, 4.0, 1.0,..."
6,date,object,0,0.00,1460,"[05/01/19, 08/03/19, 03/03/19, 27/01/19, 08/02..."
7,time,object,0,0.00,1001,"[13:08:00, 10:29:00, 13:23:00, 20:33:00, 10:37..."
8,payment_method,object,0,0.00,3,"[Ewallet, Cash, Credit card]"
9,rating,float64,0,0.00,62,"[9.1, 9.6, 7.4, 8.4, 5.3, 4.1, 5.8, 8.0, 7.2, ..."
10,profit_margin,float64,0,0.00,6,"[0.48, 0.33, 0.18, 0.57, 0.36, 0.21]"

From the detail info, check missing values and duplicates:
- there are 51 duplicated values in the dataset, will drop them later on data cleaning section.
- there are 11 columns and 10051 rows on this dataset.
- there are 31 missing values and 0.31% percent in unit_price and quantity, will drop them later in data cleaning section.
- the unit_price data type is still objects, need to be converted into float in the data cleaning section.
- date and time data type are still objects, need to be converted into datetime in the data cleaning section.

In [ ]:
# Statistics Description (Initial Exploratory Data Analysis)

print('Numerical Variables')
display(df.describe())
print('Categorical Variables')
display(df.describe(include='object'))

Numerical Variables

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

Categorical Variables

,Branch,City,category,unit_price,date,time,payment_method
count,10051,10051,10051,10020,10051,10051,10051
unique,100,98,6,1008,1460,1001,3
top,WALM058,Weslaco,Fashion accessories,$63,01/12/21,15:48:00,Credit card
freq,240,399,4579,159,48,33,4260

From the statistical description:
- there are 6 product categories, 100 braches, 98 cities and 3 payment methods.
- min profit margin is $0.18 and max profit margin is $0.57.
- min quantity is 1 and max quantity is 10.

## **3. Data Cleaning**

### **1. Drop Duplicated Values**

In [32]:
df_clean = df.copy()

df_clean.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [33]:
# drop duplicates data

df_clean.drop_duplicates(inplace=True)

# check again
display(df_clean.duplicated().sum())
display(df_clean.shape)

np.int64(0)

(10000, 11)

duplicated values are already removed from the dataset.

### **2. Drop Missing Values**

The missing values in unit_price and quantity is 0.31% percent, it's small and i couldn't do imputation to the column because there are no spesific product name, only product category, so in this cleaning, i would remove all the rows with missing values.

In [34]:
# drop all rows with missing values

df_clean.dropna(inplace=True)

# check again
display(df_clean.isna().sum() / len(df_clean) * 100)
display(df_clean.shape)

invoice_id        0.0
Branch            0.0
City              0.0
category          0.0
unit_price        0.0
quantity          0.0
date              0.0
time              0.0
payment_method    0.0
rating            0.0
profit_margin     0.0
dtype: float64

(9969, 11)

the missing values already dropped from the dataset.

## **3. Convert Data Types (unique_price, date, time)**

### **unit_price column**

In [35]:
df_clean.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [36]:
# convert unique_price data type to float

df_clean['unit_price'] = df_clean['unit_price'].str.replace('$', '').astype('float64')

# check again
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   object
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: float64(4), int64(1), object(6)
memory usage: 934.6+ KB

the unit_price column is converted to float.

### **date and time column**

In [ ]:
# convert date column to datetime data type

df_clean['date'] = pd.to_datetime(df_clean['date'])

# check again
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   datetime64[ns]
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(5)
memory usage: 934.6+ KB

In [ ]:
# convert time column to time data type
df_clean['time'] = pd.to_datetime(df_clean['time'], format='%H:%M:%S').dt.time

# check again
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   datetime64[ns]
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(5)
memory usage: 934.6+ KB

the date column is converted to datetime data type and the time column is converted to time data type as well.

## **4. Feature Generation (Adding New Feature)**

In [44]:
# add a new feature called total_amount by multiplying unit_price with quantity

df_clean['total_amount'] = df_clean['unit_price'] * df_clean['quantity']

df_clean.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total_amount
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-05-01,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-08-03,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,2019-01-27,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,2019-08-02,10:37:00,Ewallet,5.3,0.48,604.17

The data cleaning is done.

--------

**Save Clean Data To CSV**

In [53]:
df_clean.to_csv('walmart_cleaned.csv', index=False)

**Connect Python to MySQL**

In [ ]:
# connect python to mysql

# mysql toolkit
import pymysql
from sqlalchemy import create_engine

In [55]:
# mysql connection

host = "localhost"
port = "3306"
user = "root"
password = "bintang123"

engine = create_engine(f'mysql+pymysql://{user}:{password}@{host}:{port}/walmart_db')

try:
    engine
    print("Connection to MySQL database was successful!") 
except Exception as e:
    print(f"An error occurred while connecting to the database: {e}")

Connection to MySQL database was successful!

In [ ]:
# export the data to mysql

df_clean.to_sql('walmart', con=engine, if_exists='replace', index=False)

9969

The dataset is exported to MySQL.